{
    "status": "ok",
    "totalResults": 36,
    "articles": [{
        "source": {
            "id": null,
            "name": "News18.com"
        },
        "author": "Cricketnext Staff",
        "title": "From Chakravarthy's Joy to Tiwary's Disappointment - How Players Reacted to the Auction - News18",
        "description": "Sixty players were sold in the IPL Auction on Tuesday, with franchises picking players depending on availability among other factors.",
        "url": "https://www.news18.com/cricketnext/news/ipl-auction-from-chakravarthys-joy-to-tiwarys-disappointment-how-players-reacted-to-the-auction-1978059.html",
        "urlToImage": "https://images.news18.com/ibnlive/uploads/761x506/jpg/2017/05/tiwary_BCCI.jpg",
        "publishedAt": "2018-12-19T10:31:00Z",
        "content": "Manoj Tiwary is cleaned bowled by Pat Cummins. (BCCI) Sixty players were sold in the IPL Auction on Tuesday (December 18), with franchises picking players depending on availability among other factors.When it comes to international players, all eyes were on S… [+4987 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Moneycontrol.com"
        },
        "author": null,
        "title": "Closing Bell: Sensex ends with gains of over 130 pts, Nifty above 10,950; Indiabulls Housing up 8% - Moneycontrol.com",
        "description": "At the close of market hours, the Sensex was up 137.25 points or 0.38% at 36484.33, and the Nifty up 52.80 points or 0.48% at 10961.50.",
        "url": "https://www.moneycontrol.com/news/business/markets/stock-market-share-market-live-updates-bse-nseclosing-bell-sensex-ends-with-gains-of-over-130-pts-nifty-above-10950-indiabulls-housing-8-3305681.html",
        "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2018/07/Growth-Stocks-up-BSE-Niffty-Sensex-770x433.jpg",
        "publishedAt": "2018-12-19T10:04:21Z",
        "content": "Market at Close Bulls continued their momentum on Wednesday as fall in crude oil prices spurred the rally in equities. The Nifty managed to end above 10,900-mark. Among sectors, banks, automobiles, consumption, and infrastructure names were the big gainers, w… [+488 chars]"
    }, {
        "source": {
            "id": null,
            "name": "News18.com"
        },
        "author": "News18.com",
        "title": "PUBG Mobile Vikendi Map Now Available For Android And iOS: How to Download, New Features And More - News18",
        "description": "According to a Tweet by PUBG Mobile, the Vikendi snow map, which is a 6km x 6km map, will be available for download at 0:00 UTC (5:30 am IST) on 20th of December 2018, while matchmaking will begin 24 hours later.",
        "url": "https://www.news18.com/news/tech/pubg-mobile-vikendi-map-now-available-for-android-and-ios-how-to-download-new-features-and-more-1978021.html",
        "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/12/pubg-winter-.jpg",
        "publishedAt": "2018-12-19T09:45:25Z",
        "content": "Tencent Games has finally released the version 0.10.0 for all Android and iOS devices. The latest update brings the much awaited Vikendi snow map and a bunch of additional features as well as some bug fixes to the game. The new update is roughly sized 1.2GB. … [+1133 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Espn.in"
        },
        "author": null,
        "title": "Manchester United name Ole Gunnar Solskjaer as caretaker manager - ESPN",
        "description": "Ole Gunnar Solskjaer has been confirmed as Manchester United caretaker manager following the club's decision to sack Jose Mourinho.",
        "url": "http://www.espn.in/soccer/manchester-united/story/3731838/manchester-united-name-ole-gunnar-solskjaer-as-caretaker-manager",
        "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1218%2Fr479052_1296x729_16%2D9.jpg",
        "publishedAt": "2018-12-19T09:45:05Z",
        "content": "MANCHESTER, England -- Ole Gunnar Solskjaer has been confirmed as Manchester United caretaker manager following the club's decision to sack Jose Mourinho. \"Manchester United is in my heart and it's brilliant to be coming back in this role,\" Solskjaer, who sco… [+3134 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Ndtv.com"
        },
        "author": null,
        "title": "\"We Should Be Praised, Thanked\": Yogi Adityanath On Bulandshahr Criticism - NDTV News",
        "description": "Yogi Adityanath, the chief minister of Uttar Pradesh, believes that his government should be praised and thanked for whatever steps it has taken in the Bulandshahr case, in which a police officer was killed in mob frenzy over cow slaughter allegations on Dece…",
        "url": "https://www.ndtv.com/india-news/we-should-be-praised-thanked-yogi-adityanath-on-bulandshahr-criticism-1964992",
        "urlToImage": "https://c.ndtvimg.com/2018-12/k53b5v9_yogi-adityanath_625x300_18_December_18.jpg",
        "publishedAt": "2018-12-19T09:21:19Z",
        "content": "Bulandshahr violence: Yogi Adityanath has said the UP police are investigating the mob violence Lucknow: Yogi Adityanath, the chief minister of Uttar Pradesh, believes that his government should be praised and thanked for whatever steps it has taken in the Bu… [+2091 chars]"
    }, {
        "source": {
            "id": null,
            "name": "News18.com"
        },
        "author": "IANS",
        "title": "Things You Should Know if You are Suffering from PCOS - News18",
        "description": "PCOS is a hormonal disorder that can affect a women's periods, making them infrequent, irregular or prolonged, and can also make it difficult to get pregnant.",
        "url": "https://www.news18.com/news/lifestyle/things-you-should-know-if-you-are-suffering-from-pcos-1978025.html",
        "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/11/Sara-Ali-Khan4.jpg",
        "publishedAt": "2018-12-19T09:15:06Z",
        "content": "Women with polycystic ovary syndrome (PCOS) develop metabolic syndrome earlier than women without the condition, likely putting them at a higher risk of developing diabetes and cardiovascular disease, according to a new study. PCOS is a hormonal disorder that… [+1622 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Hindustantimes.com"
        },
        "author": "HT Correspondent",
        "title": "‘How can entire para be typo’: Mallikarjun Kharge seeks JPC in Rafale deal - Hindustan Times",
        "description": "Last Saturday, the defence ministry had filed an application before the Supreme Court for the correction of a paragraph in its order on the Rafale jet fighter deal.",
        "url": "https://www.hindustantimes.com/india-news/how-can-entire-para-be-typo-mallikarjun-kharge-calls-for-jpc-in-rafale-deal/story-MwtdoUqMmGEsLNOi5X4d6J.html",
        "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/12/19/Pictures/winter-session-of-parliament_6f8816d8-036c-11e9-87e0-d6de39a6b3f8.jpg",
        "publishedAt": "2018-12-19T09:02:00Z",
        "content": "Less than a week after the government had asked the Supreme Court for a correction in its order on the Rafale jet fighter deal, the Congress has continued to keep up the pressure on the government. “We want a JPC as we’ll only get to know everything when Parl… [+3931 chars]"
    }, {
        "source": {
            "id": "the-times-of-india",
            "name": "The Times of India"
        },
        "author": "Reuters",
        "title": "Trump panel recommends guns in schools to keep US students safe - Economic Times",
        "description": "Over 219,000 US students have been involved in a school shooting since the April 1999 Columbine High School massacre, according to figures collated by the Washington Post.",
        "url": "https://economictimes.indiatimes.com/news/international/world-news/trump-panel-recommends-guns-in-schools-to-keep-us-students-safe/articleshow/67159608.cms",
        "urlToImage": "https://img.etimg.com/thumb/msid-67159635,width-1070,height-580,imgsize-505908,overlay-economictimes/photo.jpg",
        "publishedAt": "2018-12-19T08:43:00Z",
        "content": "A safety panel set up by US President Donald Trump in the wake of numerous school shootings recommended on Tuesday that schools consider arming staff, using veterans as guards and reversing Obama-era guidelines. The Federal Commission on School Safety panel, … [+2417 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Indiatoday.in"
        },
        "author": null,
        "title": "Cancer risk report fallout: Johnson & Johnson baby powder samples seized in India - India Today",
        "description": "A top news agency has reported that for decades, Johnson & Johnson's raw talc and finished powders sometimes tested positive for small amounts of asbestos.",
        "url": "https://www.indiatoday.in/india/story/johnson-johnson-baby-powder-samples-seized-himachal-pradesh-1412769-2018-12-19",
        "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/201812/johnson___johnson-647x363.jpeg?jYv8aiUDLWG6.Z9ou90NeQGybott5Jeg",
        "publishedAt": "2018-12-19T08:39:17Z",
        "content": "India's central drug regulator CDSCO has seized samples of Johnson &amp; Johnson baby powder from the firm's plant in Baddi, Himachal Pradesh, Reuters reported today citing an industry source. It was Reuters, a London-based newswire, that revealed how Johnson… [+1579 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Gizmochina.com"
        },
        "author": null,
        "title": "Xiaomi Redmi 7 Pro appears in live photo, has a water-drop notch - gizmochina",
        "description": "Xiaomi‘s Redmi series is usually refreshed about every six/seven months. The Redmi 4 launched in May 2017 and its successor, the Redmi 5 was announced in December of the same year. The...",
        "url": "https://www.gizmochina.com/2018/12/19/xiaomi-redmi-7-pro-appears-in-live-photo-has-a-water-drop-notch/",
        "urlToImage": "https://www.gizmochina.com/wp-content/uploads/2018/12/Redmi-7-pro.jpg",
        "publishedAt": "2018-12-19T08:39:00Z",
        "content": "Xiaomi ‘s Redmi series is usually refreshed about every six/seven months. The Redmi 4 launched in May 2017 and its successor, the Redmi 5 was announced in December of the same year. The Redmi 6 was announced six months later and now news of the Redmi 7 has st… [+1284 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Ndtv.com"
        },
        "author": "NDTVSports.com",
        "title": "India vs Australia: Virat Kohli's \"Selection Blunders\" In Perth Baffle Sunil Gavaskar | Cricket News - NDTV Sports",
        "description": "India went in with four fast bowlers in the Perth Test, a decision that raised many eyebrows.",
        "url": "https://sports.ndtv.com/australia-vs-india-2018-19/india-vs-australia-virat-kohlis-selection-blunders-in-perth-baffle-sunil-gavaskar-1964937",
        "urlToImage": "https://c.ndtvimg.com/2018-12/m3eanl_virat-kohli_625x300_19_December_18.jpg",
        "publishedAt": "2018-12-19T08:00:37Z",
        "content": "Team India skipper Virat Kohli faced stiff criticism after his side's crushing 146-run loss to Australia in the second Test in Perth on Tuesday. Former India batsman Sunil Gavaskar hit out at \"selection blunders\" after Australia levelled the four-match series… [+1606 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Thenewsminute.com"
        },
        "author": null,
        "title": "Kerala HC dismisses Dileep’s plea for CBI probe in actor assault case - The News Minute",
        "description": "The Kerala High Court rejected actor Dileep’s plea for a CBI probe into the actor abduction and sexual assault case. Dileep has been named as the mastermind behind the abduction and assault of a popular Malayalam actor in February 2017. In his plea, Dileep al…",
        "url": "https://www.thenewsminute.com/article/kerala-hc-dismisses-dileep-s-plea-cbi-probe-actor-assault-case-93617",
        "urlToImage": "https://www.thenewsminute.com/sites/default/files/Dileep_750_2.jpg",
        "publishedAt": "2018-12-19T08:00:06Z",
        "content": "The Kerala High Court rejected actor Dileeps plea for a CBI probe into the actor abduction and sexual assault case. Dileep has been named as the mastermind behind the abduction and assault of a popular Malayalam actor in February 2017. In his plea, Dileep als… [+1541 chars]"
    }, {
        "source": {
            "id": null,
            "name": "News18.com"
        },
        "author": "News18.com",
        "title": "Zero: After Anushka and Katrina, Shah Rukh Introduces His New 'Cute' Fellow - News18",
        "description": "Shah Rukh Khan always ensures his films get the promotion they deserve, and 'Zero' is no exception.",
        "url": "https://www.news18.com/news/movies/zero-after-anushka-and-katrina-shah-rukh-introduces-his-new-cute-fellow-1977901.html",
        "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/11/Zero-Poster-Feature.jpg",
        "publishedAt": "2018-12-19T07:39:57Z",
        "content": "Shah Rukh Khan always ensures his films get the promotion they deserve, and Zero is no exception. Be it celebrating his character Bauua Singh's birthday or sharing behind the sets videos, the actor has kept the noise around Zero going. With only two days rema… [+1686 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Ndtv.com"
        },
        "author": null,
        "title": "Green Leafy Vegetables May Keep Liver Diseases At Bay - NDTV News",
        "description": "According to a recent study, published in the journal PNAS, higher consumption of green leafy vegetables may reduce the risk of developing liver diseases.",
        "url": "https://www.ndtv.com/food/green-leafy-vegetables-may-keep-liver-diseases-at-bay-1964915",
        "urlToImage": "https://c.ndtvimg.com/2018-12/4mq9ocv_green-leafy_625x300_19_December_18.jpg",
        "publishedAt": "2018-12-19T07:29:00Z",
        "content": "According to a recent study, published in the journal PNAS, higher consumption of green leafy vegetables may reduce the risk of developing liver diseases. About 25 percent of the global population suffers from liver steatosis or fatty liver, which is mostly c… [+1676 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Timesnownews.com"
        },
        "author": null,
        "title": "BJP hits back at Manmohan Singh for 'not afraid of press' jibe, says 'PM Modi doesn't need prompter, script' - Times Now",
        "description": "The Bharatiya Janata Party, on Wednesday, hit out at former Prime Minister Manmohan Singh, over his 'not afraid of press' remarks, and alleged that Singh was used to talking 'on someone’s order and script'.",
        "url": "https://www.timesnownews.com/india/article/bjp-hits-back-at-manmohan-singhs-not-afraid-of-press-jibe-says-pm-modi-doesnt-need-prompter-script/333475",
        "urlToImage": "https://img.timesnownews.com/story/1545204420-Mukhtar_Abbas_Naqvi_ANI.jpg",
        "publishedAt": "2018-12-19T07:26:00Z",
        "content": "New Delhi: The Bharatiya Janata Party (BJP), on Wednesday, hit out at former Prime Minister Manmohan Singh over his comments on PM Modi and said that PM Modi 'does not need a script'. On Tuesday, Singh had said that he was 'not afraid of speaking with the pre… [+1134 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Ndtv.com"
        },
        "author": null,
        "title": "This Winter, Here's Why You Must Load Up On Probiotics - NDTV News",
        "description": "Good bacteria present in probiotics helps in fighting off infections caused by parasites, viruses, yeast and fungi. Here are some reasons why probiotics are important during winter.",
        "url": "https://www.ndtv.com/health/this-winter-heres-why-you-must-load-up-on-probiotics-1964891",
        "urlToImage": "https://i.ndtvimg.com/i/2018-01/probiotics-for-weight-loss_650x400_41515060853.jpg",
        "publishedAt": "2018-12-19T07:15:00Z",
        "content": "It is a well-known fact that probiotics are important for your digestive health. They help in providing good bacteria to your gut and facilitate healing of a damaged gut lining. Probiotics help in rejuvenating good bacteria in your gut, while getting rid of e… [+3179 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Financialexpress.com"
        },
        "author": "FE Online",
        "title": "Twitter wars: Rahul Gandhi beats PM Modi at his own game - The Financial Express",
        "description": "",
        "url": "https://www.financialexpress.com/india-news/twitter-wars-rahul-gandhi-beats-pm-modi-at-his-own-game/1418351/",
        "urlToImage": "https://images.financialexpress.com/2018/12/MODI-VS-RAHUL.jpg",
        "publishedAt": "2018-12-19T05:43:10Z",
        "content": "Rahul Gandhi has outwitted tech-savvy Prime Minister Narendra Modi on Twitter, confirming with the Congress president’s newfound enthusiasm leading up to significant electoral gains in the last few months. While PM Modi continues to be one of the most followe… [+4172 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Rushlane.com"
        },
        "author": "Staff writer",
        "title": "Maruti Gypsy, 800, Omni first gen owners celebrate 35 years of Maruti - Video - RushLane",
        "description": "First time such an event has been organized to celebrate the classic and iconic Maruti cars of yesteryear, which shaped the Indian car industry we know today. Hat tip to automotive enthusiast and Youtuber Saurabh Pawar for making this video.",
        "url": "https://www.rushlane.com/maruti-gypsy-800-omni-celebration-12291185.html",
        "urlToImage": "https://www.rushlane.com/wp-content/uploads/2018/12/maruti-classic-day-drive-omni-800-gypsy.jpg",
        "publishedAt": "2018-12-19T05:39:00Z",
        "content": "Nostalgia comes in different forms and if you were born and brought up in this part of the world, you would probably have some interesting memories involving Maruti Suzuki cars. Maruti Suzuki has grown with us and for many, it was the first car in our family.… [+2316 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Ndtv.com"
        },
        "author": null,
        "title": "Inside Ankita Lokhande's Birthday Bash With Kangana Ranaut, Mouni Roy - NDTV Movies",
        "description": "Ankita Lokhande first launched the trailer of Manikarnika with Kangana Ranaut and then celebrated her birthday",
        "url": "http://movies.ndtv.com/photos/inside-ankita-lokhande-s-birthday-bash-with-kangana-ranaut-mouni-roy-96886",
        "urlToImage": "https://drop.ndtv.com/albums/ENTERTAINMENT/ankitalokhandebirthday/1ankitacake_ndtv_700_191518_111545_4953.jpg",
        "publishedAt": "2018-12-19T05:38:00Z",
        "content": "Source: Photo: Santosh Nagwekar For Ankita Lokhande it was double celebration on Tuesday as the trailer of her debut film Manikarnika: The Queen Of Jhansi released on her birthday. After launching the trailer of Manikarnika together, Kangana and Ankita celebr… [+67 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Hindustantimes.com"
        },
        "author": "HT Correspondent",
        "title": "Others will face same arrogance: Upendra Kushwaha’s new dig at BJP is a warning to NDA allies - Hindustan Times",
        "description": "Kushwaha quit as a minister at the Centre earlier in December and also walked out the BJP-led alliance and said that he has his options open.",
        "url": "https://www.hindustantimes.com/india-news/others-will-face-same-arrogance-upendra-kushwaha-warns-bjp-allies/story-2lIyXwhb56lqU4Otj5keHK.html",
        "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/12/19/Pictures/pti12-10-2018-000079b_73bc4080-034e-11e9-b709-b8f5f1e83cec.jpg",
        "publishedAt": "2018-12-19T05:28:00Z",
        "content": "Rashtriya Lok Samta Party chief Upendra Kushwaha has said he exited the National Democratic Alliance (NDA) because of what he described as, the arrogance of the BJP and Bihar chief minister Nitish Kumar, news agency ANI reports. “Others will also face the sam… [+1095 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Indianexpress.com"
        },
        "author": "Express Web Desk",
        "title": "ISRO to launch communication satellite GSAT-7A from Sriharikota today - The Indian Express",
        "description": "The newest satellite will provide communication capability to users in Ku-band over the Indian region, ISRO said adding that the mission life of the GSAT-7A is eight years.",
        "url": "https://indianexpress.com/article/technology/science/isro-gsat-7a-launch-today-live-updates-5499858/",
        "urlToImage": "https://images.indianexpress.com/2018/12/GSAT-7A-759.jpg?w=759",
        "publishedAt": "2018-12-19T05:05:40Z",
        "content": "The GSLV-F11 will inject GSAT-7A into a Geosynchronous Transfer Orbit (GTO). (Source: Twitter/ ISRO) The Indian Space Research Organisation (ISRO) will launch on Wednesday GSAT-7A, a geostationary communication satellite, from Satish Dhawan Space Centre in An… [+1259 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Biospectrumindia.com"
        },
        "author": null,
        "title": "Depression, Anxiety can increase the risk of heart diseases: Study - BSI bureau",
        "description": "The study published in the journal Health Psychology showed that cancer was found as an exception to conditions impacted by depression and anxiety.",
        "url": "https://biospectrumindia.com/news/58/12303/depression-anxiety-can-increase-the-risk-of-heart-diseases-study.html",
        "urlToImage": "https://biospectrumindia.com/uploads/articles/index-12303.jpg",
        "publishedAt": "2018-12-19T04:58:46Z",
        "content": "The study published in the journal Health Psychology showed that cancer was found as an exception to conditions impacted by depression and anxiety. Being anxious or depressed can increase risks for heart disease and stroke, the same as smoking and obesity, ac… [+1644 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Timesnownews.com"
        },
        "author": null,
        "title": "From Varun Chakravarthy to Shivam Dube, 5 players who stunned fans with their selling price at IPL auction - Times Now",
        "description": "There were many surprises and upsets at IPL 2019 auction that took place on Tuesday. Here's a look at top five players who surprised with their selliong price at the auction -",
        "url": "https://www.timesnownews.com/sports/cricket/article/from-varun-chakravarthy-to-shivam-dube-5-players-who-stunned-fans-with-their-selling-price-at-ipl-auction/333372",
        "urlToImage": "https://img.timesnownews.com/story/1545194738-ipl.jpg",
        "publishedAt": "2018-12-19T04:55:45Z",
        "content": "The auction for the upcoming season of the Indian Premier League (IPL) took place on Tuesday in Jaipur. Manoj Tiwary, the first player up for auction, did not find a buyer in two attempts while Yuvraj Singh, who had once topped the auction, only got one bid i… [+2757 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Weather.com"
        },
        "author": "",
        "title": "Saturn is Losing its Rings: NASA - The Weather Channel",
        "description": "But don't worry; they'll still be around for about 100 million years.",
        "url": "https://weather.com/en-IN/india/science/news/2018-12-18-saturn-losing-rings-nasa",
        "urlToImage": "https://s.w-x.co/in-saturn.jpg",
        "publishedAt": "2018-12-19T04:20:19Z",
        "content": "A view of Saturn's northern hemisphere. (NASA/JPL-Caltech/Space Science Institute) Saturn is losing its iconic rings at the maximum rate estimated from Voyager 1 and 2 observations made decades ago, confirms new NASA research that estimates that the rings hav… [+2537 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Hindustantimes.com"
        },
        "author": "Hindustan Times",
        "title": "Akshay Kumar, Ajay Devgn, Karan Johar meet PM Modi to discuss issues faced by film industry - Hindustan Times",
        "description": "Actors Akshay Kumar and Ajay Devgn and film producer Karan Johar met Prime Minister Narendra Modi on Tuesday to discuss issues faced by the film industry.",
        "url": "https://www.hindustantimes.com/bollywood/akshay-kumar-ajay-devgn-karan-johar-meet-pm-modi-to-discuss-issues-faced-by-film-industry/story-2Bk3M7LnwoQNUAQc1G2EEK.html",
        "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/12/19/Pictures/_3c31a678-033a-11e9-b709-b8f5f1e83cec.jpg",
        "publishedAt": "2018-12-19T03:04:00Z",
        "content": "A delegation of Bollywood producers and actors such as Akshay Kumar, Ajay Devgn and Karan Johar Tuesday called on Prime Minister Narendra Modi, who was on a one-day visit to Maharashtra, at Raj Bhavan here to discuss the issues being faced by the Indian film … [+3431 chars]"
    }, {
        "source": {
            "id": null,
            "name": "News18.com"
        },
        "author": "Vivek Trivedi",
        "title": "After Farm Loan Waiver, Kamal Nath Sets Eyes on MP Youth in Run-up to 2019 Elections - News18",
        "description": "The new chief minister’s move, however, has not gone down well with the opposition parties, with the BJP and the JD(U) accusing him of fuelling ‘divisive’ politics.",
        "url": "https://www.news18.com/news/politics/after-farm-loan-waiver-kamal-nath-sets-eyes-on-mp-youth-in-run-up-to-2019-elections-1977605.html",
        "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/05/kamal-nath.jpg",
        "publishedAt": "2018-12-19T02:38:38Z",
        "content": "Bhopal: Newly appointed Madhya Pradesh chief minister Kamal Nath, who raked up a storm with his remarks on people from UP and Bihar snatching jobs in the state, seems to have identified the latest target group of the Congress in the run-up to the 2019 electio… [+3178 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Livemint.com"
        },
        "author": "Mihir Dalal",
        "title": "Binny Bansal seeks $100 mn from Walmart after Flipkart exit - Livemint",
        "description": "Binny Bansal’s Flipkart exit makes him eligible to receive an immediate, smaller payment from Walmart for his stake worth $850 million in the e-commerce firm",
        "url": "https://www.livemint.com/Companies/PHEYFQ5l7dTbnn73Yprc1N/Binny-Bansal-seeks-100-mn-from-Walmart-after-Flipkart-exit.html",
        "urlToImage": "https://www.livemint.com/rf/Image-621x414/LiveMint/Period2/2018/12/19/Photos/Processed/binny-bansal-keJF--621x414@LiveMint.JPG",
        "publishedAt": "2018-12-19T01:51:04Z",
        "content": "Bengaluru: Flipkart co-founder Binny Bansal is negotiating fresh terms to receive cash payouts from Walmart after he resigned from Flipkart as chairman and group chief executive last month, two people familiar with the matter said. According to his earlier co… [+3683 chars]"
    }, {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": null,
        "title": "Xbox in 2018: The Year in Review - IGN",
        "description": "We look back on the Xbox year that was, from the disappointing (the exclusive games) to the awesome (everything else).",
        "url": "https://www.ign.com/articles/2018/12/19/xbox-in-2018-the-year-in-review",
        "urlToImage": "https://assets1.ignimgs.com/2018/12/19/forzahorizon4-fortuneisland-fixed-1545180108020_1280w.jpg",
        "publishedAt": "2018-12-19T01:32:08Z",
        "content": "By Ryan McCaffrey The year of Xbox in 2018 has been almost Jekyll-and-Hyde-ian. Software-wise, the lack of high-quality first-party exclusives continues to be the story. But hardware and services were unrivaled, and Microsoft tripled their first-party studio … [+3609 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Firstpost.com"
        },
        "author": null,
        "title": "Michael Flynn sentencing key takeaway: Donald Trump is having a terrible December; it just got much worse - Firstpost",
        "description": "In a stunning turn of events, a federal judge in Washington lashed out at US president Donald Trump's acolyte and first national security advisor Michael Flynn, a retired Army lieutenant general who pleaded guilty last year to lying to the Federal Bureau of I…",
        "url": "https://www.firstpost.com/world/michael-flynn-sentencing-takeaway-donald-trump-is-having-a-terrible-december-it-just-got-much-worse-5754081.html",
        "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/12/flynn-380.jpg",
        "publishedAt": "2018-12-18T23:13:51Z",
        "content": "New York: In a stunning turn of events, a federal judge in Washington lashed out at US president Donald Trump's acolyte and first national security advisor Michael Flynn, a retired Army lieutenant general who pleaded guilty last year to lying to the Federal B… [+5922 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Nasaspaceflight.com"
        },
        "author": null,
        "title": "2018 VG18 – “Farout” is the furthest known object in the Solar System – for now - NASASpaceflight.com",
        "description": null,
        "url": "https://www.nasaspaceflight.com/2018/12/2018-vg18-farout-furthest-object-solar-system-now/",
        "urlToImage": null,
        "publishedAt": "2018-12-18T21:48:31Z",
        "content": "The boundaries of astronomical discovery keep getting pushed, especially in the 21st century with new technologies and equipment being put on line at a rapid pace. On December 17, 2018, 115 years to the day after the Wright Brothers made their first flight, a… [+4033 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Trust.org"
        },
        "author": "Thomson Reuters Foundation",
        "title": "SpaceX halts U.S. satellite launch for national security mission - Thomson Reuters Foundation",
        "description": "SPACE-SPACEX/LAUNCH (UPDATE 2, PIX, TV):UPDATE 2-SpaceX halts U.S. satellite launch for national security mission",
        "url": "http://www.trust.org/item/20181218144844-kadx4/",
        "urlToImage": "https://d2sh4fq2xsdeg9.cloudfront.net/contentAsset/image/ee0346dc-685f-4330-921e-f32d5b90458d/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100",
        "publishedAt": "2018-12-18T17:16:00Z",
        "content": "(Adds Pence comments on Space Command, paragraphs 5-6) By Joey Roulette ORLANDO, Fla., Dec 18 (Reuters) - Elon Musk's SpaceX halted Tuesday's launch of a long-delayed navigation satellite for the U.S. military, postponing for at least a day the space transpor… [+3053 chars]"
    }, {
        "source": {
            "id": "the-hindu",
            "name": "The Hindu"
        },
        "author": "Reuters",
        "title": "New discovery pushes back origin of feathers - The Hindu",
        "description": "Study suggests that fur-like covering of pterosaurs made up of rudimentary feathers",
        "url": "https://www.thehindu.com/sci-tech/science/new-discovery-pushes-back-origin-of-feathers/article25775955.ece",
        "urlToImage": "https://www.thehindu.com/sci-tech/science/l41ej/article25775954.ece/ALTERNATES/LANDSCAPE_615/THJC-PTEROSAURFOSSILS2",
        "publishedAt": "2018-12-18T16:43:55Z",
        "content": "A microscopic examination of fossils from China has revealed that the fur-like body covering of pterosaurs, the remarkable flying reptiles that lived alongside dinosaurs, was actually made up of rudimentary feathers. The surprising discovery described by scie… [+1578 chars]"
    }, {
        "source": {
            "id": null,
            "name": "Gizmochina.com"
        },
        "author": null,
        "title": "Lenovo Z5 Pro GT vs Xiaomi Mi Mix 3 10 GB vs Huawei Mate 20 Pro: Specs Comparison - gizmochina",
        "description": "The first phone with Snapdragon 855, Lenovo Z5 Pro GT, compared with the other best Chinese flagships: Huawei Mate 20 Pro and Xiaomi Mi Mix 3 10 GB!",
        "url": "https://www.gizmochina.com/2018/12/18/lenovo-z5-pro-gt-vs-xiaomi-mi-mix-3-10-gb-vs-huawei-mate-20-pro-specs-comparison/",
        "urlToImage": "https://www.gizmochina.com/wp-content/uploads/2018/12/gt.jpg",
        "publishedAt": "2018-12-18T16:09:00Z",
        "content": "After a year of affordable devices, Lenovo surprised everyone by launching Z5 Pro GT, the most powerful phone in the whole Android world. Is it able to beat the hottest Chinese devices of the moment even when it comes to value for money and other specificatio… [+5095 chars]"
    }, {
        "source": {
            "id": "the-hindu",
            "name": "The Hindu"
        },
        "author": "Special Correspondent",
        "title": "Mumbai techie Hamid Nihal Ansari back in India after his release from Pakistan jail - The Hindu",
        "description": "He was detained in 2012 by Pakistan’s intelligence agencies and local police in Kohat for illegal entry from Afghanistan, reportedly to meet a girl he had befriended online.",
        "url": "https://www.thehindu.com/news/national/mumbai-techie-hamid-ansari-back-in-india-after-release-from-pakistan-jail/article25774197.ece",
        "urlToImage": "https://www.thehindu.com/news/national/13vlj6/article25774196.ece/ALTERNATES/LANDSCAPE_615/0001BO6AB",
        "publishedAt": "2018-12-18T12:47:39Z",
        "content": "Hamid Nehal Ansari, an Indian national in the custody of Pakistani authorities, was repatriated on Tuesday. He was united with his family at the Wagah-Attari border crossing where his mother and peace activists welcomed him. The return of Mr. Ansari, who had … [+1395 chars]"
    }, {
        "source": {
            "id": "the-times-of-india",
            "name": "The Times of India"
        },
        "author": null,
        "title": "Kapil Sharma donates leftover food from his wedding, reception and other wedding-related festivities - Times of India",
        "description": "Kapil Sharma's wedding in Jalandhar and Amritsar grabbed a lot of attention and had a crazy turnout. Not only that, we have learned that the comedy ki",
        "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kapil-sharma-donates-leftover-food-from-his-wedding-reception-and-other-wedding-related-festivities/articleshow/67141657.cms",
        "urlToImage": "https://static.toiimg.com/photo/msid-67141657/67141657.jpg?826466",
        "publishedAt": "2018-12-18T07:28:41Z",
        "content": null
    }, {
        "source": {
            "id": null,
            "name": "Hindustantimes.com"
        },
        "author": "Agence France-Presse",
        "title": "As Brexit vote approaches, here are four possible scenarios for UK and the deal - Hindustan Times",
        "description": "Here are the four main scenarios facing Britain while the clock ticks down to March 29, 2019 -- the day it is scheduled to depart the European project after 46 years",
        "url": "https://www.hindustantimes.com/world-news/what-next-for-brexit/story-0WKHkA5ueeme5YDaIH34LK.html",
        "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/12/17/Pictures/deal-leaders-summit-with-danger-brexit-increasing_6e234698-0216-11e9-87e0-d6de39a6b3f8.jpg",
        "publishedAt": "2018-12-17T16:18:00Z",
        "content": "British prime minister Theresa May faces a dwindling number of options over Brexit after EU leaders at a summit last week rebuffed her attempts to tweak a Brexit deal she struck with them. Here are the four main scenarios facing Britain while the clock ticks … [+3829 chars]"
    }]
}